# Need to run this brew command on the commmand line before being able to use this Brewfile:
# brew tap Homebrew/bundle

# After tapping that package, run this command to install apps inside this file:
# brew bundle

# Installing apps from Mac App Store
# Each application in the Mac App Store has a product identifier which is also used for mas-cli commands. Using 'mas list' will show all installed applications and their product identifiers.
# It is possible to search for applications by name using 'mas search' which will search the Mac App Store and return matching identifier.

cask_args appdir: '/Applications'

tap 'argon/mas'
tap 'caskroom/cask'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'caskroom/versions' # required for google-chrome-canary
tap 'neovim/neovim'

brew 'ack'
brew 'cmake'
brew 'git'
brew 'homebrew/dupes/grep'
brew 'icdiff'
brew 'mas' #Used to install apps from Mac App Store using 'mas' command at the bottom of this file
brew 'mongodb'
brew 'neovim/neovim/neovim'
brew 'node'
brew 'noti'
brew 'openssl'
brew 'python'
brew 'ruby'
brew 'tree'
brew 'zsh'

cask '1password'
cask 'airfoil'
cask 'atom'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cd-to'
cask 'dropbox'
cask 'doxie'
#cask 'eye-fi'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2'
cask 'karabiner'
cask 'keycastr'
cask 'kindle'
cask 'moom'
cask 'omnidisksweeper'
cask 'openemu'
cask 'opera'
#cask 'plug'
cask 'radiant-player'
cask 'robomongo'
cask 'sizeup'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'superduper'
cask 'textwrangler'
cask 'the-unarchiver'
#cask 'transmission'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

# App Store applications
mas '1Keyboard', id: 766939888
mas 'aText', id: 488566438
mas 'GIPHY CAPTURE', id: 668208984
#mas 'Integrity', id: 513610341
mas 'JSON Query', id: 953006734
mas 'Microsoft OneNote', id: 784801555
mas 'Pixelmator', id: 407963104
mas 'Pocket', id: 568494494
mas 'Quiver', id: 866773894
mas 'Sip', id: 507257563
mas 'Slack', id: 803453959
mas 'Wimoweh', id: 610341008
mas 'Wunderlist', id: 410628904
#mas 'Xcode', id: 497799835
